app/views/chefs/show.html.erb


    <% @chef.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."chef_id" = ?  [["chef_id", 1]]