app/controllers/chefs_controller.rb

  def index
    if params[:search]
      @chefs = Chef.near(params[:search], 1, units: :km)
    elsif params[:longitude] && params[:latitude]
      @chefs = Chef.near([params[:latitude], params[:longitude]], 1, units: :km)
    else
      @chefs = Chef.all
---
SELECT "chefs".* FROM "chefs"

  def show
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @chef = Chef.new(chef_params)

    if @chef.save
---
INSERT INTO "chefs" ("name", "email", "encrypted_password", "experience", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)